import React, { useEffect, useState } from "react";
import axios from "axios";
import Loading from "../../components/Loading";

const Products = () => {
  const [loading, setLoading] = useState(true);
  const [products, setProducts] = useState([]);

  const dummyProducts = [
    {
      title: "ابل ايفون 13 128 جيجابايت - اخضر، بشريحتين",
      price: "32,999.00 جنيه",
    },
    {
      title:
        "موبايل ايفون 11 مع تطبيق فيس تايم بذاكرة داخلية 128 جيجابايت وذاكرة RAM سعة 4 جيجابايت وشبكة 4G LTE وشريحة واحدة وشريحة مدمجة - ابيض، شريحة",
      price: "26,950.00 جنيه",
    },
    {
      title:
        "ابل موبايل ايفون 11 مع فيس تايم - 128 جيجا، ذاكرة رام 4 جيجا، الجيل الرابع ال تي اي، اخضر، شريحة اتصال واحدة وشريحة الكترونية",
      price: "26,999.00 جنيه",
    },
    {
      title:
        "موبايل سامسونج جالاكسي S23 الترا، بذاكرة رام 12 جيجا، موبايل ذكي يعمل بنظام اندرويد بشريحتين اتصال لون أسود فانتوم",
      price: "45,100.00 جنيه",
    },
    {
      title:
        "هاتف ذكي 90 الجيل الخامس 5G من هونر كاميرا ثلاثية 200 ميجابكسل شاشة أموليد منحنية 6.7 بوصة و120 هرتز 12 جي بي+512 جي بي بطارية 5000أم أيه أتش شحن سريع 66 وات بطاقتين أندرويد 13 أسود ميدنايت شريحتين",
      price: "24,888.00 جنيه",
    },
    {
      title:
        "موبايل ريدمي نوت 12 بشريحتي اتصال بذاكرة RAM  8 جيجابايت وذاكرة ROM 128 جيجابايت بشبكة اتصال الجيل الخامس 4G LTE - لون اونيكس جراي من شاومي",
      price: "8,499.00 جنيه",
    },
    {
      title:
        "موبايل سامسونج جالاكسي A54 شبكة الجيل الخامس 5G بشريحتين اتصال وبنظام اندرويد وذاكرة RAM 8 جيجابايت وذاكرة تخزين 256 جيجابايت بلون ابيض رائع",
      price: "17,763.76 جنيه",
    },
    {
      title:
        "موبايل ريلمي C53 ثنائي بشريحتين وذاكرة ROM سعة 256 جيجابايت وذاكرة رام 8 جيجابايت وشبكة 4G (شامبيون جولد) - إصدار الشرق الأوسط، ريلمي سي 53",
      price: "6,999.00 جنيه",
    },
    {
      title:
        "موبايل ريلمي C53 ثنائي شرائح الاتصال بذاكرة ROM 128 جيجابايت وذاكرة رام 6 جيجابايت شبكة الجيل الرابع 4G ذهبي شامبيون - نسخة الشرق الأوسط، ريلمي سي 53",
      price: "6,200.00 جنيه",
    },
    {
      title:
        "موبايل سامسونج جالاكسي A54 بشريحتي الاتصال، بنظام تشغيل اندرويد وذاكرة RAM 8 جيجابايت وذاكرة تخزين داخلية 256 جيجابايت، لون جرافيت، بشريحتين، جرافيت رائع",
      price: "17,763.76 جنيه",
    },
    {
      title:
        "TORRAS Pstand-Mag Case for iPhone 15 Pro Max Case Shockproof Beyond 12FT TOP N56 Magnets for MagSafe Charging, 0.03 in Invisible Stand Truly Completely Flat Slim Case for iPhone 15 Pro Max Cover Black",
      price: "1,550.00 جنيه",
    },
    {
      title:
        "موبايل ذكي من بلاك فيو،A95 8 جيجابات+128 جيجابات، ثنائي شرائح الاتصال 4G وكاميرا ثلاثية 20 ميجابسكل بتقنية الذكاء الاصطناعي، 4380 مللي امبير في الساعة، معرف الوجه/بصمة الإصبع، أسود، ايه 95",
      price: "6,999.00 جنيه",
    },
    {
      title:
        "ذاكرة رام 8 جيجابايت من نوثبنج فون+ ذاكرة تخزين 256 جيجابايت وواجهة جليف وكاميرا مزدوجة 50 ميجابيكسل وشاشة OLED 6.55 بوصة/ 120 هرتز، اسود، نوثينج فون 1 بشريحتين",
      price: "26,500.00 جنيه",
    },
    {
      title:
        "حافظة اصلية فاخرة غير لامعة من انخ جيفت شوب مع عدسة زجاجية حماية، حافظات ايه جي عالية الجودة متوافقة مع ايفون [ماج*سافي] (سييرا بلو، ايفون 12 برو)",
      price: "450.00 جنيه",
    },
    {
      title:
        "حافظة جلدية من ابل بتقنية ماج سيف لجهاز ايفون 13 برو ماكس - سيكويا الأخضر، سيليكون",
      price: "4,000.00 جنيه",
    },
    {
      title:
        "جراب حماية لموبايل ايفون 14 برو ماكس مع واقي عدسة الكاميرا متوافق مع شاحن ماج سيف ومضاد للخدش والصدمات بتصميم رفيع مطلي بالكهرباء للنساء والرجال من اووك، ارجواني، البولي يوريثين الحراري",
      price: "280.00 جنيه",
    },
    {
      title:
        "شاحن ايفون معتمد من ابل 20 وات موصل للطاقة بكابل شحن السريع بمنفذ USB C إلى كابل لايتنينج بطول 6 قدم لايفون 13/12/11/XS/XR/X/ايباد، ايربودز برو، ابيض",
      price: "245.00 جنيه",
    },
    {
      title:
        "موبايل شاومي بوكو C40 بشريحتي اتصال، شاشة 6.71 بوصة، ذاكرة 4 جيجابايت RAM، ذاكرة 64 جيجابايت ROM، شبكة الجيل الرابع ال تي اي - اخضر مرجاني",
      price: "5,333.00 جنيه",
    },
    {
      title:
        "كابل لايتنينج بطول 1 متر لشاحن ايفون للشحن السريع ومزامنة البيانات عالي السرعة متوافق مع ايفون 14/13/12/11 برو ماكس/XS ماكس/XR/XS/X/8/7/بلس/6S",
      price: "109.99 جنيه",
    },
    {
      title:
        "نيلكن جراب حماية سوبر فروستد شيلد برو سيريز مصمم لموبايل ابل ايفون 15 برو ماكس (مع فتحة للشعار) - رمادي تيتانيوم",
      price: "1,500.00 جنيه",
    },
    {
      title:
        "جراب 360 لهاتف ايفون 13 برو ماكس هو جراب يوفر حماية شاملة ومتكاملة للهاتف من جميع الجوانب.، حافظة بسيطة، بلاستيك، ازرق",
      price: "45.00 جنيه",
    },
    {
      title:
        "كابل لايتنينج لشاحن ايفون بطول 3 أمتار معتمد من ام اف اي لأجهزة ابل ايفون 12, 12 و12 برو/ ماكس و12 ميني و11 و11 برو/ ماكس وXR وXS/ ماكس وX و8 و7 و6 و5 وSE واي باد (أزرق)",
      price: "299.00 جنيه",
    },
    {
      title:
        "CELLMASTER iPhone 13 Pro Lens Protector Compatible for 13 Pro /13 Pro Max iPhone Accessories Silver",
      price: "54.00 جنيه",
    },
    {
      title:
        "حامل موبايل مغناطيسي للسيارة يثبت على فتحة التهوية بدون استخدام اليدين متوافق مع شاحن ماج سيف مناسب لسلسلة ايفون 13/ 12 برو ماكس (فضي) من ليزين",
      price: "4,300.00 جنيه",
    },
    {
      title:
        "جراب حماية بولي يوريثين حراري رفيع شفاف عالي الدقة ممتص للصدمات ومضاد للخدوش بجهة خلفية بولي كربونات لموبايل ايفون 11 (6.1 بوصة)",
      price: "46.67 جنيه",
    },
    {
      title:
        "شاشة بديلة لجهاز ايفون 12 برو ماكس مقاس 6.7 بوصة (داخلي) محول رقمي لشاشة تعمل باللمس مجموعة كاملة",
      price: "4,375.00 جنيه",
    },
    {
      title:
        "قاعدة شحن لاسلكية 3 في 1 للشحن السريع، حامل شاحن لاسلكي لايفون 14/13/12/11 برو ماكس/اكس/اكس اس/ماكس/8/8 بلس، ايربودز 3/2/برو 2، اي ووتش سلسلة 8/7/6/5/اس اي/4/3/2، قاعدة شحن، أسود",
      price: "1,799.00 جنيه",
    },
    {
      title:
        "موبايل ون بلس 11R شبكة الجيل الخامس 5G، ذاكرة رام 16 جيجابايت، سعة تخزين داخلية 256 جيجابايت منفذ USB (لون فضي جالاكتيك)، بشريحتين",
      price: "28,950.00 جنيه",
    },
    {
      title:
        "موبايل سامسونج جالاكسي S23 شبكة الجيل الخامس 5G (بنفسجي فاتح، 8 جيجا، السعة التخزينية 256 جيجابايت)، بلوتوث، USB، بشريحتين",
      price: "36,950.00 جنيه",
    },
    {
      title:
        "جراب شفاف من اورازي، للايفون 12 وايفون 12 برو مضاد للاصفرار جراب رفيع واقي، ممتص للصدمات، 2020 شفاف من البولي يوريثين الحراري ايفون 12 برو",
      price: "68.88 جنيه",
    },
    {
      title:
        "شاشة حماية للحفاظ على الخصوصية (لموبايل ايفون 12 برو ماكس،6.7 بوصة)، شفاف",
      price: "65.00 جنيه",
    },
    {
      title:
        "جراب غوريلا سيليكون شفاف بزوايا مضادة للصدمات من البولي يوريثين المقاوم للحرارة لموبايل ايفون 15 من دلع موبايلك - شفاف",
      price: "83.33 جنيه",
    },
    {
      title:
        "جيم باد اجهزة تحكم الالعاب للهواتف الذكية متوافق مع متعدد، ماكنتوش، الأشعة تحت الحمراء , متعدد الالوان",
      price: "120.00 جنيه",
    },
    {
      title:
        "جراب حماية بغطاء لحماية الكاميرا كام شيلد برو مصمم لموبايل ابل ايفون 15 برو ماكس من نيلكن، أسود، البولي يوريثين الحراري",
      price: "480.00 جنيه",
    },
    {
      title:
        "جراب ناعم ثلاثي الأبعاد ستيتشي مع قبعة لموبايل ايفون 15 برو ماكس | 15 | 14 برو ماكس | 14/13 | 13 برو ماكس | 12 برو ماكس | 11 | X/Xs | XS | XS ماكس غطاء لطيف مضاد للصدمات من فكرة (وردي، ايفون 15)",
      price: "399.00 جنيه",
    },
  ];

  useEffect(() => {
    (async () => {
      setLoading(true);
      try {
        const res = await axios.get("http://178.62.199.143/scrape", {
          url: "https://www.amazon.eg/",
          category: "iphone",
        });
        const data = await res.json();
        setLoading(false);
        setProducts(dummyProducts);
      } catch (err) {
        setLoading(false);
        setProducts(dummyProducts);
        console.log(err);
      }
      setLoading(false);
    })();
  }, []);

  if (loading) return <Loading />;

  return (
    <main className="main__page">
      <h1 className="page__title">Products</h1>
      <table className="main__table">
        <thead>
          <tr>
            <th>Name</th>
            <th>Price</th>
          </tr>
        </thead>
        <tbody>
          {products?.map((product, i) => (
            <tr key={i}>
              <td>{product?.title}</td>
              <td>{product?.price}</td>
            </tr>
          ))}
        </tbody>
      </table>
    </main>
  );
};

export default Products;
